<?php // ตัวอย่างโปรแกรมที่ 3.5 การใช้ตัวดำเนินการต่อประโยคและตัวดำเนินการทางคณิตศาสตร์
   $name = "Steve Rogers";   
   $age = 40;
   $str = $name." อายุ ".$age." ปี";  // การต่อประโยค
   $x1 = $age+20;                       // การบวก
   $x2 = $age-5;                        // การลบ
   $x3 = $x1*$x2;                       // การคูณ
   $x4 = $x1/$x2;                        // การหาร
   $x5 = $x1%5;                         // การหารเก็บเศษ
   echo $str."<BR>";
   echo $x1."<BR>";
   echo $x2."<BR>";
   echo $x3."<BR>";
   echo $x4."<BR>";
   echo $x5;
?>