<?php // ตัวอย่างโปรแกรมที่ 3.4 ตัวอย่างการประกาศตัวแปรใช้งาน
    $name="Steve Rogers";       // ประกาศตัวแปรข้อความ
    $salary=40000;              // ประกาศตัวแปรตัวเลขจำนวนเต็ม
    $savingRate=3.50;           // ประกาศตัวแปรตัวเลขจำนวนจริง
    $x[1] = 5; $x[2] = 10;      // ประกาศตัวแปรใช้โครงสร้างแบบอาเรย์โดยมีดัชนีเป็นตัวเลข
    $customer['year'] = 5;      // ประกาศตัวแปรใช้โครงสร้างแบบอาเรย์โดยมีดัชนีเป็นชื่อ
    echo "Name: ".$name."<BR>";
    echo "Salary: ".$salary."<BR>";
    echo "X1 = ".$x[1]." X2 = ".$x[2]."<BR>";
    echo "Customer (year): ".$customer['year'];
?>